{
    "united states of america": {
      "info": "The United States is a country primarily located in North America.",
      "povertyPercentage": 1.0
    },
    "canada": {
      "info": "Canada is the second-largest country in the world by land area.",
      "povertyPercentage": 0.8
    },
    "brazil": {
      "info": "Brazil is the largest country in both South America and Latin America.",
      "color": "#3357ff",
      "intensity": 0.7
    },
    "india": {
      "info": "India is the seventh-largest country by land area and the most populous democracy in the world.",
      "color": "#ff33a1",
      "intensity": 0.9
    },
    "china": {
      "info": "China is the world's most populous country, with over 1.4 billion people.",
      "color": "#f1c40f",
      "intensity": 0.85
    },
    "russia": {
      "info": "Russia is the largest country in the world, spanning Eastern Europe and northern Asia."
    },
    "australia": {
      "info": "Australia is a country and continent surrounded by the Indian and Pacific oceans."
    },
    "france": {
      "info": "France, in Western Europe, is renowned for its culture, cuisine, and landmarks like the Eiffel Tower."
    },
    "germany": {
      "info": "Germany is known for its history, technology, and the Oktoberfest beer festival."
    },
    "united kingdom": {
      "info": "The United Kingdom is an island nation made up of England, Scotland, Wales, and Northern Ireland."
    },
    "italy": {
      "info": "Italy, in southern Europe, is known for its rich history, art, and cuisine, including pizza and pasta."
    },
    "japan": {
      "info": "Japan is an island country in East Asia, known for its technology, culture, and cherry blossoms."
    },
    "mexico": {
      "info": "Mexico is a country in North America known for its vibrant culture, ancient ruins, and cuisine."
    },
    "south africa": {
      "info": "South Africa is known for its diverse landscapes, wildlife, and cultural heritage."
    },
    "argentina": {
      "info": "Argentina is known for tango music and dance, and its stunning Andes mountains."
    },
    "nigeria": {
      "info": "Nigeria is Africa's most populous country and a major economic and cultural powerhouse.",
    "povertyPercentage": 43.0
    },
    "egypt": {
      "info": "Egypt is famous for its ancient civilization and monuments like the Pyramids of Giza."
    },
    "spain": {
      "info": "Spain is known for its sunny beaches, cultural festivals, and historic cities."
    },
    "south korea": {
      "info": "South Korea is a tech-forward nation known for K-pop, technology, and traditional culture."
    },
    "north korea": {
        "info": "South Korea is a tech-forward nation known for K-pop, technology, and traditional culture."
      },
    "saudi arabia": {
      "info": "Saudi Arabia is known for its deserts, oil wealth, and the cities of Mecca and Medina."
    },
    "indonesia": {
      "info": "Indonesia is the world's largest archipelago, known for its diverse cultures and biodiversity."
    },
    "pakistan": {
      "info": "Pakistan is known for its rich history, diverse landscapes, and cultural heritage."
    },
    "bangladesh": {
      "info": "Bangladesh is a South Asian country known for its rivers, culture, and textiles."
    },
    "iran": {
      "info": "Iran is known for its ancient Persian heritage and significant role in Middle Eastern geopolitics."
    },
    "iraq": {
        "info": "Iran is known for its ancient Persian heritage and significant role in Middle Eastern geopolitics."
      },
    "turkey": {
      "info": "Turkey bridges Europe and Asia and is famous for its rich history and landmarks like Hagia Sophia."
    },
    "thailand": {
      "info": "Thailand is a Southeast Asian country known for its beaches, temples, and vibrant culture."
    },
    "vietnam": {
      "info": "Vietnam is known for its rich history, cuisine, and natural beauty like Halong Bay."
    },
    "philippines": {
      "info": "The Philippines is an archipelago in Southeast Asia known for its beaches and hospitality."
    },
    "ethiopia": {
      "info": "Ethiopia is one of the oldest nations in the world, with a rich cultural and historical heritage."
    },
    "colombia": {
      "info": "Colombia is a country in South America known for its coffee, culture, and biodiversity."
    },
    "kenya": {
      "info": "Kenya is famous for its wildlife safaris, national parks, and cultural heritage."
    },
    "afghanistan": {
        "info": "Afghanistan is a landlocked country in South Asia known for its rugged terrain and rich history."
    },
    "albania": {
        "info": "Albania is a small country in Southeast Europe known for its stunning Adriatic and Ionian coastlines."
    },
    "algeria": {
        "info": "Algeria is the largest country in Africa, known for its Sahara desert landscapes and Mediterranean coastline."
    },
    "andorra": {
        "info": "Andorra is a small, mountainous country between France and Spain, known for its ski resorts."
    },
    "angola": {
        "info": "Angola is a country in Southern Africa with rich natural resources and a diverse culture."
    },
    "antigua and barbuda": {
        "info": "Antigua and Barbuda is a Caribbean nation known for its beaches and coral reefs."
    },
    "armenia": {
        "info": "Armenia is a country in the South Caucasus region, known for its ancient Christian heritage."
    },
    "austria": {
        "info": "Austria is a landlocked country in Central Europe known for its Alpine scenery and classical music."
    },
    "azerbaijan": {
        "info": "Azerbaijan is known as the 'Land of Fire,' located at the crossroads of Europe and Asia."
    },
    "bahamas": {
        "info": "The Bahamas is an island nation in the Atlantic Ocean known for its beaches and vibrant marine life."
    },
    "bahrain": {
        "info": "Bahrain is a small island nation in the Middle East, known for its pearl diving history and modern architecture."
    },
    "barbados": {
        "info": "Barbados is a Caribbean island nation known for its beaches, music, and culture."
    },
    "belarus": {
        "info": "Belarus is a landlocked country in Eastern Europe, known for its Soviet-era architecture and vast forests."
    },
    "belgium": {
        "info": "Belgium is known for its medieval towns, Renaissance architecture, and as the headquarters of the EU."
    },
    "belize": {
        "info": "Belize is a small country in Central America known for its barrier reef and Mayan ruins."
    },
    "benin": {
        "info": "Benin is a West African country known for its role in the history of the Kingdom of Dahomey."
    },
    "bhutan": {
        "info": "Bhutan is a Himalayan kingdom known for its Gross National Happiness index and monasteries."
    },
    "bolivia": {
        "info": "Bolivia is a landlocked country in South America known for its high-altitude cities and salt flats."
    },
    "bosnia and herz.": {
        "info": "Bosnia and Herzegovina is a Balkan country known for its medieval villages and Ottoman-era heritage."
    },
    "botswana": {
        "info": "Botswana is known for its wildlife safaris and the Okavango Delta."
    },
    "brunei": {
        "info": "Brunei is a small, wealthy nation on the island of Borneo in Southeast Asia."
    },
    "bulgaria": {
        "info": "Bulgaria is a Balkan nation with a rich history, known for its mountains and Black Sea coastline."
    },
    "burkina faso": {
        "info": "Burkina Faso is a landlocked country in West Africa known for its cultural heritage and festivals."
    },
    "burundi": {
        "info": "Burundi is a small, landlocked country in East Africa known for its rolling hills and coffee production."
    },
    "cambodia": {
        "info": "Cambodia is home to the famous Angkor Wat temple complex and a rich cultural heritage."
    },
    "cameroon": {
        "info": "Cameroon is often called 'Africa in Miniature' for its diverse landscapes and cultures."
    },
    "cape verde": {
        "info": "Cape Verde is an island nation off the coast of West Africa, known for its Creole culture and music."
    },
    "central african rep.": {
        "info": "The Central African Republic is known for its wildlife and national parks."
    },
    "chad": {
        "info": "Chad is a landlocked country in Central Africa with diverse landscapes and cultures."
    },
    "chile": {
        "info": "Chile is a long, narrow country in South America, known for the Andes mountains and Atacama Desert."
    },
    "comoros": {
        "info": "The Comoros is a volcanic archipelago off Africa's east coast, known for its beaches and marine life."
    },
    "costa rica": {
        "info": "Costa Rica is known for its biodiversity, rainforests, and eco-tourism."
    },
    "croatia": {
        "info": "Croatia is a Balkan country known for its Adriatic coastline and medieval towns."
    },
    "cuba": {
        "info": "Cuba is a Caribbean island nation known for its vibrant music, culture, and cigars."
    },
    "cyprus": {
        "info": "Cyprus is an island nation in the Mediterranean, known for its ancient history and sunny beaches."
    },
    "czechia": {
        "info": "The Czech Republic, also known as Czechia, is known for its historic capital Prague and medieval castles."
    },
    "dem. rep. congo": {
        "info": "The Democratic Republic of the Congo is a vast Central African country with abundant natural resources."
    },
    "congo": {
        "info": "The Democratic Republic of the Congo is a vast Central African country with abundant natural resources."
    },
    "denmark": {
        "info": "Denmark is a Scandinavian country known for its design, Vikings, and happy citizens."
    },
    "djibouti": {
        "info": "Djibouti is a small country in the Horn of Africa known for its strategic location and unique landscapes."
    },
    "dominican rep.": {
        "info": "The Dominican Republic is a Caribbean nation known for its beaches, resorts, and music."
    },
    "puerto rico": {
        "info": "The Dominican Republic is a Caribbean nation known for its beaches, resorts, and music."
    },
    "ecuador": {
        "info": "Ecuador is known for its Galápagos Islands, Andes mountains, and Amazon rainforest."
    },
    "el salvador": {
        "info": "El Salvador is the smallest country in Central America, known for its volcanoes and surf beaches."
    },
    "equatorial guinea": {
        "info": "Equatorial Guinea is a small Central African country with mainland and island regions."
    },
    "eritrea": {
        "info": "Eritrea is a Northeast African country on the Red Sea coast, known for its Italian colonial buildings."
    },
    "estonia": {
        "info": "Estonia is a Baltic country known for its medieval capital Tallinn and digital innovation."
    },
    "eswatini": {
        "info": "Eswatini, formerly Swaziland, is known for its wilderness reserves and traditional Swazi culture."
    },
    "fiji": {
        "info": "Fiji is an island nation in the South Pacific, known for its beaches, reefs, and hospitality."
    },
    "finland": {
        "info": "Finland is a Northern European nation known for its lakes, forests, and the Northern Lights."
    },
    "gabon": {"info": "Gabon is a country along the Atlantic coast of Central Africa, known for its national parks."},
    "gambia": {"info": "The Gambia is a small West African country known for its beaches and the Gambia River."},
    "georgia": {"info": "Georgia is a country at the intersection of Europe and Asia, known for its Caucasus mountain villages."},
    "ghana": {"info": "Ghana is a West African nation known for its rich culture, history, and natural resources."},
    "greece": {"info": "Greece is known for its ancient ruins, stunning islands, and Mediterranean cuisine."},
    "grenada": {"info": "Grenada, also known as the Spice Isle, is a Caribbean country known for its nutmeg production."},
    "guatemala": {"info": "Guatemala is a Central American country known for its Mayan heritage and volcanoes."},
    "guinea": {"info": "Guinea is a West African country known for its natural resources and diverse landscapes."},
    "guinea-bissau": {"info": "Guinea-Bissau is a West African country known for its national parks and wildlife."},
    "guyana": {"info": "Guyana is a South American country known for its dense rainforests and British colonial architecture."},
    "haiti": {"info": "Haiti is a Caribbean nation on the island of Hispaniola, known for its history and culture."},
    "honduras": {"info": "Honduras is a Central American country known for its Mayan ruins and beautiful beaches."},
    "hungary": {"info": "Hungary is a landlocked Central European country known for its capital, Budapest, and thermal baths."},
    "iceland": {"info": "Iceland is a Nordic island country known for its volcanoes, geysers, and hot springs."},
    "greenland": {"info": "Iceland is a Nordic island country known for its volcanoes, geysers, and hot springs."},
    "ireland": {"info": "Ireland is an island nation in Europe known for its green landscapes and rich history."},
    "antarctica": {"info": "Iceland is a Nordic island country known for its volcanoes, geysers, and hot springs."},
    "israel": {"info": "Israel is a Middle Eastern country on the Mediterranean Sea, significant in world history and religion."},
    "jamaica": {"info": "Jamaica is a Caribbean island nation known for its reggae music and beautiful beaches."},
    "jordan": {"info": "Jordan is a Middle Eastern country known for its ancient city of Petra and the Dead Sea."},
    "kazakhstan": {"info": "Kazakhstan is a Central Asian country known for its vast steppes and modern capital, Astana."},
    "kiribati": {"info": "Kiribati is a remote Pacific island nation known for its marine life and atolls."},
    "kosovo": {"info": "Kosovo is a partially recognized country in the Balkans known for its cultural heritage."},
    "kuwait": {"info": "Kuwait is a small Middle Eastern country known for its oil wealth and modern architecture."},
    "kyrgyzstan": {"info": "Kyrgyzstan is a Central Asian country known for its mountains and nomadic traditions."},
    "laos": {"info": "Laos is a Southeast Asian country known for its mountainous terrain and Buddhist monasteries."},
    "latvia": {"info": "Latvia is a Baltic nation known for its forests, beaches, and medieval architecture in Riga."},
    "lebanon": {"info": "Lebanon is a Middle Eastern country known for its cedar trees, history, and Mediterranean cuisine."},
    "lesotho": {"info": "Lesotho is a high-altitude, landlocked country encircled by South Africa."},
    "liberia": {"info": "Liberia is a West African country known for its history as a nation founded by freed slaves."},
    "libya": {"info": "Libya is a North African country known for its deserts and ancient Roman ruins."},
    "liechtenstein": {"info": "Liechtenstein is a tiny, doubly landlocked Alpine country in Central Europe."},
    "lithuania": {"info": "Lithuania is a Baltic country known for its medieval Old Towns and Hill of Crosses."},
    "luxembourg": {"info": "Luxembourg is a small, wealthy European country known for its castles and banking industry."},
    "madagascar": {"info": "Madagascar is an island nation known for its unique wildlife and biodiversity."},
    "malawi": {"info": "Malawi is a landlocked country in southeastern Africa known for Lake Malawi."},
    "malaysia": {"info": "Malaysia is a Southeast Asian country known for its rainforests and modern capital, Kuala Lumpur."},
    "maldives": {"info": "The Maldives is a tropical paradise in the Indian Ocean known for its beaches and coral reefs."},
    "mali": {"info": "Mali is a landlocked country in West Africa known for its ancient cities like Timbuktu."},
    "malta": {"info": "Malta is a Mediterranean island nation known for its historic sites and sunny weather."},
    "marshall islands": {"info": "The Marshall Islands is an island nation in the Pacific known for its atolls and marine life."},
    "mauritania": {"info": "Mauritania is a country in West Africa known for its vast deserts and Atlantic coastline."},
    "mauritius": {"info": "Mauritius is an island nation in the Indian Ocean known for its beaches and lagoons."},
    "micronesia": {"info": "Micronesia is a Pacific island nation known for its coral reefs and ancient ruins."},
    "moldova": {"info": "Moldova is a small Eastern European country known for its wine and rolling hills."},
    "monaco": {"info": "Monaco is a tiny, wealthy city-state on the French Riviera known for its casinos and Grand Prix."},
    "mongolia": {"info": "Mongolia is a landlocked country in East Asia known for its vast steppes and nomadic culture."},
    "montenegro": {"info": "Montenegro is a Balkan country known for its mountains and medieval villages."},
    "morocco": {"info": "Morocco is a North African country known for its markets, historic cities, and desert landscapes."},
    "mozambique": {"info": "Mozambique is a southern African country known for its Indian Ocean coastline and marine parks."},
    "myanmar": {"info": "Myanmar, formerly Burma, is known for its Buddhist temples and ancient cities like Bagan."},
    "namibia": {"info": "Namibia is a southern African country known for its Namib Desert and wildlife."},
    "nauru": {"info": "Nauru is a tiny island nation in the Pacific known for its phosphate mining."},
    "nepal": {"info": "Nepal is a Himalayan country known for Mount Everest and its Buddhist monasteries."},
    "netherlands": {"info": "The Netherlands is known for its windmills, tulips, and canals in Amsterdam."},
    "new zealand": {"info": "New Zealand is a Pacific island nation known for its landscapes and Maori culture."},
    "nicaragua": {"info": "Nicaragua is a Central American country known for its lakes, volcanoes, and colonial cities."},
    "niger": {"info": "Niger is a landlocked West African country known for its Sahara desert and historic trading routes."},
    "w. sahara": {"info": "Niger is a landlocked West African country known for its Sahara desert and historic trading routes."},
    "macedonia": {"info": "North Macedonia is a Balkan country known for its lakes, mountains, and historic sites."},
    "norway": {"info": "Norway is a Nordic country known for its fjords, northern lights, and Viking history."},
    "oman": {"info": "Oman is a Middle Eastern country known for its deserts, forts, and Arabian Sea coastline."},
    "palau": {"info": "Palau is a Pacific island nation known for its coral reefs and diving spots."},
    "panama": {"info": "Panama is a Central American country known for its canal connecting the Atlantic and Pacific."},
    "papua new guinea": {"info": "Papua New Guinea is a Pacific nation known for its cultural diversity and rainforests."},
    "paraguay": {"info": "Paraguay is a landlocked South American country known for its rivers and colonial history."},
    "peru": {"info": "Peru is a South American country known for its Incan heritage and Machu Picchu."},
    "poland": {"info": "Poland is a Central European country known for its medieval architecture and vibrant cities like Warsaw."},
    "portugal": {"info": "Portugal is a southern European country known for its Atlantic coastline and rich history."},
    "qatar": {"info": "Qatar is a small, wealthy Gulf nation known for its oil wealth and modern skyline in Doha."},
    "romania": {"info": "Romania is known for its medieval castles and the Carpathian mountains."},
    "rwanda": {"info": "Rwanda is a small African country known for its mountain gorillas and green landscapes."},
    "san marino": {"info": "San Marino is one of the world's smallest countries, located within Italy."},
    "côte d'ivoire": {"info": "San Marino is one of the world's smallest countries, located within Italy."},

    "sao tome and principe": {
        "info": "São Tomé and Príncipe is a small island nation in the Gulf of Guinea, known for its cocoa production."
    },
    "senegal": {
        "info": "Senegal is a West African country known for its vibrant culture and historic sites."
    },
    "serbia": {
        "info": "Serbia is a Balkan country known for its history, mountains, and medieval monasteries."
    },
    "seychelles": {
        "info": "The Seychelles is an Indian Ocean archipelago known for its beaches and coral reefs."
    },
    "sierra leone": {
        "info": "Sierra Leone is a West African country known for its beaches and history of diamond mining."
    },
    "singapore": {
        "info": "Singapore is a global financial hub and city-state known for its cleanliness and efficiency."
    },
    "slovakia": {
        "info": "Slovakia is a landlocked Central European country known for its castles and mountains."
    },
    "slovenia": {
        "info": "Slovenia is a small European country known for its mountains, ski resorts, and lakes."
    },
    "solomon islands": {
        "info": "The Solomon Islands is a Pacific nation known for its World War II history and coral reefs."
    },
    "somalia": {
        "info": "Somalia is a country in the Horn of Africa with a long coastline along the Indian Ocean."
    },
    "sri lanka": {
        "info": "Sri Lanka is an island nation south of India, known for its tea, beaches, and ancient ruins."
    },
    "sudan": {
        "info": "Sudan is a country in Northeast Africa known for its deserts and ancient pyramids."
    },
    "s. sudan": {
        "info": "Sudan is a country in Northeast Africa known for its deserts and ancient pyramids."
    },
    "suriname": {
        "info": "Suriname is a small South American country known for its rainforests and Dutch colonial history."
    },
    "sweden": {
        "info": "Sweden is a Scandinavian country known for its forests, lakes, and high standard of living."
    },
    "switzerland": {
        "info": "Switzerland is a mountainous Central European country known for its neutrality and banking."
    },
    "syria": {
        "info": "Syria is a Middle Eastern country with a rich history and ancient cities like Damascus."
    },
    "tajikistan": {
        "info": "Tajikistan is a Central Asian country known for its mountains and Silk Road history."
    },
    "tanzania": {
        "info": "Tanzania is an East African country known for Mount Kilimanjaro and Serengeti National Park."
    },
    "taiwan": {
        "info": "Tanzania is an East African country known for Mount Kilimanjaro and Serengeti National Park."
    },
    "timor-leste": {
        "info": "Timor-Leste is a Southeast Asian country known for its rugged mountains and coral reefs."
    },
    "togo": {
        "info": "Togo is a small West African country known for its palm-lined beaches and coffee production."
    },
    "tonga": {
        "info": "Tonga is a Polynesian kingdom of more than 170 islands in the Pacific Ocean."
    },
    "trinidad and tobago": {
        "info": "Trinidad and Tobago is a Caribbean nation known for its Carnival and calypso music."
    },
    "tunisia": {
        "info": "Tunisia is a North African country known for its Mediterranean coastline and ancient ruins."
    },
    "turkmenistan": {
        "info": "Turkmenistan is a Central Asian country known for its vast deserts and marble architecture."
    },
    "tuvalu": {
        "info": "Tuvalu is a tiny Pacific island nation known for its low-lying atolls and lagoons."
    },
    "uganda": {
        "info": "Uganda is an East African country known for its wildlife and Lake Victoria."
    },
    "ukraine": {
        "info": "Ukraine is a large Eastern European country known for its fertile plains and rich history."
    },
    "united arab emirates": {
        "info": "The UAE is a Middle Eastern federation known for its modern cities like Dubai and Abu Dhabi."
    },
    "uruguay": {
        "info": "Uruguay is a South American country known for its beaches and laid-back lifestyle."
    },
    "uzbekistan": {
        "info": "Uzbekistan is a Central Asian country known for its Silk Road cities like Samarkand."
    },
    "vanuatu": {
        "info": "Vanuatu is a Pacific island nation known for its scuba diving and active volcanoes."
    },
    "vatican city": {
        "info": "Vatican City is the smallest country in the world and the spiritual center of the Catholic Church."
    },
    "venezuela": {
        "info": "Venezuela is a South American country known for its oil resources and Angel Falls."
    },
    "yemen": {
        "info": "Yemen is a Middle Eastern country known for its historic cities and ancient architecture."
    },
    "zambia": {
        "info": "Zambia is a southern African country known for its Victoria Falls and wildlife safaris."
    },
    "zimbabwe": {
        "info": "Zimbabwe is a southern African country known for its landscapes and ancient ruins like Great Zimbabwe."
    }
}
